БухЭксп/InformationRegisters/CW_ПараметрыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияИмяАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьФамилиюИмяАнгл(ФизЛицо) Экспорт 
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ПараметрыСотрудников.ФамилияИмяАнгл
		|ИЗ
		|	РегистрСведений.CW_ПараметрыСотрудников КАК CW_ПараметрыСотрудников
		|ГДЕ
		|	CW_ПараметрыСотрудников.Сотрудник = &ФизЛицо"
	);
	з.УстановитьПараметр("ФизЛицо", ФизЛицо);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Если выб.Следующий() Тогда 
		Возврат выб.ФамилияИмяАнгл;
	Иначе 
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура УстановитьФамилиюИмяАнгл(ФизЛицо, ФИОАнгл) Экспорт 
	Если ЗначениеЗаполнено(ФизЛицо) Тогда 
		рсНЗ = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьНаборЗаписей();
		рсНЗ.Отбор.Сотрудник.Значение = ФизЛицо;
		рсНЗ.Отбор.Сотрудник.Использование = Истина;
		рсНЗ.Прочитать();
		рсмз = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьМенеджерЗаписи();
		Если рсНЗ.Количество()=0 Тогда 
			рсмз.Сотрудник = ФизЛицо;
		Иначе 
			рсмз.Сотрудник = ФизЛицо;
			рсмз.Период = рснз[0].Период;
			рсмз.Прочитать();
		КонецЕсли;
		рсмз.ФамилияИмяАнгл = ФИОАнгл;
		рсмз.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
